Soap/operation/INTERNAL/INTERNAL_Samples/evaluate_INTERNAL_Mandatory.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_OPERATION xmlns="urn:amlyze-services:EvaluateOperationService_v2r0">
            <CommunicationNumber>Com_97</CommunicationNumber>
            <Requester>Financial_institution</Requester>
            <OperationType>INTERNAL</OperationType>
            <RiskManagementCategory>OP_DEFAULT</RiskManagementCategory>
            <SourceOfRiskLevel>EVALUATE</SourceOfRiskLevel>
            <OperationExtId>Op_0097</OperationExtId>
            <FinancialFlowDirection>NULL</FinancialFlowDirection>
            <OperationDateTime>2023-01-08T09:09:33+02:00</OperationDateTime>
            <Currency>EUR</Currency>
            <Amount>2222</Amount>
            <Description>Agreement Nr 1005, 2022-10-01</Description>
            <ListOperationParty>
                <OperationParty>
                    <PartyRole>DEBTOR</PartyRole>
                    <AccountNumber>LV6630800200000018155</AccountNumber>
                    <BIC>BICXX22</BIC>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                </OperationParty>
                <OperationParty>
                    <PartyRole>CREDITOR</PartyRole>
                    <AccountNumber>LV7730800200000018166</AccountNumber>
                    <BIC>BICXX22</BIC>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                </OperationParty>
        </ListOperationParty>
    </AMLYZE_OPERATION>
</soap:Body>
</soap:Envelope>